# 驻留机制:同样的字符串 指向同一个地址
a = "hello world"
b = "hello world"
# 字符串同为hello world,此时id相同
print("a", id(a))  # 123
print("b", id(b))  # 123

# #驻留机制在以下情况才有效(也得看IDE是否有优化):
# 1.26个英文字母大小写,0-9数字,下划线组成的字符串
# 2.字符串长度为0或1
# 3.编译时有驻留,非运行时
# 4[-5,256]整数数字

# 测试 IDE对驻留机制的扩充
# 1. 字符串常量池
c = """ !@#$%^&*()_+{}[]|\:;\ """
d = """ !@#$%^&*()_+{}[]|\:;\ """
print("c", id(c))
print("d", id(d))
# 2. 整数常量池
e = -1234567890123456789012345678
f = -1234567890123456789012345678
print("e", id(e))
print("f", id(f))
# 3.中文字符串
g = "你好，世界！"
h = "你好，世界！"
print("g", id(g))
print("h", id(h))
