# 字典 dictionaries
# 为了防止列表增删改以后下标混乱 原有下标做废的情况

# # 场景1
# names = ["张", "王", "李"]
# names.insert(0, "留")
# print(names[0])  # 当初的0是张 现在是刘

# # 解决方案1
# # names_dict = {"001": "张", "002": "王", "003": "李"}
# names_dict = {"002": "王", "003": "李", "001": "张"}
# print(names_dict["001"])  # 无论位置如何 都输出张


# # 场景2
# stu = [[12, "张鹏华"], [13, "李红"], [14, "王帅"]]
# print(stu[0][0])  # 如果添加一个元素将不在输出原有信息了

# # 解决方案2 字典的嵌套
stu_dict = {
    "01": {"id": 12, "name": "张鹏华"},
    "02": {"id": 13, "name": "李红"},
    "03": {"id": 14, "name": "王帅"},
}

print(stu_dict["01"]["name"])
